In [1]:
#Create a Series with 5 fruit names and their corresponding colors as a DataFrame.

In [2]:
Fruits = ['Apple','Orange','Pineapple','Kiwi','Strawberries']

In [3]:
type(Fruits)

list

In [4]:
import pandas as pd

In [23]:
Fruits_name = pd.Series(Fruits, name="fname")

In [24]:
Fruits_name

0           Apple
1          Orange
2       Pineapple
3            Kiwi
4    Strawberries
Name: fname, dtype: object

In [25]:
df = Fruits_name.to_frame()

In [26]:
df

          fname
0         Apple
1        Orange
2     Pineapple
3          Kiwi
4  Strawberries

In [27]:
df['Color'] = ['Red','Orange','Yellow','Green','Pink']

In [28]:
df

          fname   Color
0         Apple     Red
1        Orange  Orange
2     Pineapple  Yellow
3          Kiwi   Green
4  Strawberries    Pink

In [32]:
df['Origin'] = ['Central Asia', 'Southeast Asia','South America','China','North America']

In [33]:
df

          fname   Color          Origin
0         Apple     Red    Central Asia
1        Orange  Orange  Southeast Asia
2     Pineapple  Yellow   South America
3          Kiwi   Green           China
4  Strawberries    Pink   North America

In [34]:
countryname = [ 'England','India','Russia']

In [35]:
countryname

['England', 'India', 'Russia']

In [36]:
type(countryname)

list

In [41]:
cn = pd.Series(countryname, name = "Country")

In [42]:
cn

0    England
1      India
2     Russia
Name: Country, dtype: object

In [43]:
df = cn.to_frame()

In [44]:
df

   Country
0  England
1    India
2   Russia

In [45]:
df['Population'] = [30000,20000,10000]

In [46]:
df

   Country  Population
0  England       30000
1    India       20000
2   Russia       10000

In [47]:
#Topic 3: Concatenating DataFrames

In [48]:
#Creating a dataframe for 3 students

In [49]:
students = ['Alice','Bob','Cherry']

In [50]:
type(students)

list

In [74]:
stu = pd.Series(students, name='students_name')

In [75]:
stu

0     Alice
1       Bob
2    Cherry
Name: students_name, dtype: object

In [76]:
df = stu.to_frame()

In [77]:
df

  students_name
0         Alice
1           Bob
2        Cherry

In [79]:
df['email'] = ['alice@gmail.com','bob@gmail.com','cherry@gmail.com']

In [80]:
df

  students_name             email
0         Alice   alice@gmail.com
1           Bob     bob@gmail.com
2        Cherry  cherry@gmail.com

In [102]:
new_data = {'A' : 'Steve'}

In [103]:
new_data

{'A': 'Steve'}

In [104]:
type(df1)

pandas.core.frame.DataFrame

In [105]:
df1 = pd.DataFrame([new_data])

In [106]:
df1

       A
0  Steve

In [100]:
df = pd.concat([df,df1])

In [107]:
df

  students_name             email      A
0         Alice   alice@gmail.com    NaN
1           Bob     bob@gmail.com    NaN
2        Cherry  cherry@gmail.com    NaN
0           NaN               NaN  Steve
0           NaN               NaN  Steve

In [108]:
nw2 = {'A' : 'Bill'}

In [109]:
nw2

{'A': 'Bill'}

In [111]:
df2 = pd.DataFrame([nw2])

In [112]:
df2

      A
0  Bill

In [122]:
df = pd.concat([df,df2])

In [123]:
df

       A
0  Steve
0   Bill
0   Bill
0   Bill
0   Bill
0   Bill